// Lab3.7.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

void DrawSquare(int width, int height, char symbol)
{
    for (int i = 0; i < height; i++)
        for (int j = 0; j < width; j++)
        {
            cout << ((i == 0 || j == 0 || i == height - 1 || j == width - 1) ? symbol : ' ');
            if (j == width - 1)
                cout << endl;

        }
}

int main()
{
    int width, height;
    char symbol;
    cout << "Enter width and height: ";
    cin >> width >> height;
    cout << "Enter the symbol with which the rectangle will be drawn in : ";
    cin >> symbol;
    DrawSquare(width, height, symbol);
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
